9/data/attachments/14f2f565505efde3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Luke_clearly_Friend_28388_3</nif:username>
            <nif:friendToBeRequested>soap_friends_e14a244b-93c0-48b8-8d81-c113e96e4042</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>